app/Http/Controllers/Auth/AuthenticatedSessionController.php

update `users` set `session_id` = null, `users`.`updated_at` = '2025-03-06 16:25:57' where `username` = 'fahath'
---
    public function resetLoginSessionSubmit(Request $request)
    {
        $user = User::whereUsername($request->username)->update(['session_id' => null]);