app/Http/Controllers/Site/Product/ProductController.php

select * from `products`
---
    public function index()
    {
        $products = Product::get();