app/Listeners/TrackingUserLoginListen.php

    public function handle(object $event)
    {
        if (Auth::check()) {

            $user = User::find(Auth::user()->id);

            $data = [
                'user_id' => $user->id,
                'action' => request()->route()->getName() === 'logout' ? 'logout' : 'login',
                'session_id' => session()->getId(),
                'status' => 'success',
            ];

            // Conditionally add login_time or logout_time
            if ($data['action'] === 'login') {
                $data['login_time'] = now();
            } elseif ($data['action'] === 'logout') {
                $data['logout_time'] = now();
            }

            UserLoginActivityLog::createLog($data);

            $user->session_id = request()->route()->getName() === 'logout' ? null : session()->getId();
            $user->save();
---
select * from `users` where `users`.`id` = 1 limit 1
update `users` set `session_id` = 'V73LY7iy69iSc6QcvnG8OAfGcBqsHd0dFXBCyNdb', `users`.`updated_at` = '2025-03-06 16:26:00' where `id` = 1