app/Helpers/Helpers.php

insert into `user_logs` (`user_id`, `user_name`, `form_name`, `form_record_id`, `log_action`, `browser`, `create_date`, `created_at`, `updated_at`) values (1, 'Fahath ', 'Contact Master', 'Contact Master', 'View', 'Chrome', '2025-03-06 16:28:25', '2025-03-06 16:28:25', '2025-03-06 16:28:25')
---
    function logActivity($log_form_name = "", $log_form_record_code = "", $log_action = "",  $log_form_record_detail = "",  $log_user = "")
    {
        $log_user = auth()->user();
        $log_cdate = now();

        $userAgent =  request()->header('User-Agent');
        $pattern = "/(MSIE|Trident|Firefox|Chrome|Safari|Opera)/i";

        if (preg_match($pattern, $userAgent, $matches)) {
            $log_browser =  $matches[0];
        }

        $msg = " | ";
        $msg .= 'userID: ' . $log_user->id . " | ";
        $msg .= 'userName: ' . $log_user->full_name . " | ";
        $msg .= 'formName: ' . $log_form_name . " | ";
        $msg .= 'formRecordID: ' . $log_form_record_code . " | ";
        $msg .= 'Action: ' . $log_action . " | ";
        $msg .= 'formRecordDesc: ' . $log_form_record_detail . " | ";
        $msg .= 'Date: ' . $log_cdate . " | ";


        if ($log_user) {
            DB::table('user_logs')->insert([
                'user_id'        => $log_user->id,
                'user_name'      => $log_user->full_name,
                'form_name'      => $log_form_name,
                'form_record_id'      => $log_form_record_code,
                'log_action'     => $log_action,
                'browser'        => $log_browser,
                'create_date'    => now(),
                'created_at'     => now(),
                'updated_at'     => now(),
            ]);

select * from `categories`
---
    function getCategories()
    {
        return Category::get();