app/Helpers/Menu.php

    function getMenu()
    {
        // Check if the logged-in user has a "super-admin" role
        $user = auth()->user();
        $isSuperAdmin = $user->hasRole('Super-Admin');

        // If the user is not a super-admin, filter based on permissions
        if (!$isSuperAdmin) {
            $LoggedUserAccesspermissions = collect($user->getPermissionsViaRoles()->toArray())
                ->pluck('name')
                ->filter(fn($permission) => str_contains($permission, '-view'))
                ->map(fn($permission) => str_replace('-view', '', $permission))
                ->unique()
                ->values()
                ->toArray();
        } else {
            // If user is a super-admin, allow access to all menus
            $LoggedUserAccesspermissions = [];
        }

        // Retrieve the header menu
        $HeaderMenu =  DB::table('menu_headers')->where('is_active', 1)->get();

        // Retrieve the detail menu with or without permission filtering
        $DetailMenu = DB::table('menu_details')
            ->where('is_active', 1)
            ->when(!$isSuperAdmin, function ($query) use ($LoggedUserAccesspermissions) {
                $query->where(function ($q) use ($LoggedUserAccesspermissions) {
                    $q->whereIn('menu_slug', $LoggedUserAccesspermissions)
                        ->orWhere('is_submenu_available', 1);
                });
            })
            ->orderBy('sequence', 'asc')
            ->get();

        // Retrieve the sub-menu detail with or without permission filtering
        $SubMenuDetail = DB::table('menu_sub_details')
            ->where('is_active', 1)
            ->when(!$isSuperAdmin, function ($query) use ($LoggedUserAccesspermissions) {
                $query->whereIn('menu_slug', $LoggedUserAccesspermissions);
            })
            ->get();
---
select * from `menu_headers` where `is_active` = 1
select * from `menu_details` where `is_active` = 1 order by `sequence` asc
select * from `menu_sub_details` where `is_active` = 1