app/Http/Requests/Auth/LoginRequest.php

    private function checkUserAvailability($request)
    {
        $user = User::where('username', $request['username'])
            ->with('roles')
            ->first();
---
select * from `users` where `username` = 'fahath' limit 1