app/Http/Controllers/Site/Home/HomeController.php

select * from `products`
select * from `categories`
---
    public function index(Request $request)
    {

        $products = Product::get();


        return view('site.home.index', [
            'categories' => Category::get(),
            'products' => $products,
        ]);